設定=[]
進貨=[]
出貨=[]
營業額統計=[]
庫存統計=[]
顧客=[]
i=1
a=int(input('有幾顆蘋果?'))
b=int(input('一顆蘋果幾元?'))
while i!=0:
    print('*****************************************************')
    print('請選擇下列功能')
    A=int(input('1,設定.2,進貨.3,出貨.4,營業額統計.5,庫存統計.6,離開系統 :'))
    if A==1:
        print('*****************************************************')
        a=int(input('有幾顆蘋果?'))
        b=int(input('一顆蘋果幾元?'))
        設定.append(a,b)
    if A==2:
        print('*****************************************************')
        c=int(input('進貨幾顆?'))
        進貨.append(c)
    if A==3:    
        print('*****************************************************')
        d=int(input('買了幾顆蘋果?'))
        e=print('要付:',b*d,'元。')
        顧客.append(d)
        出貨.append([d,e])
        summ=sum(顧客)
    if A==4:
        print('*****************************************************')
        f=print('有',len(出貨),'筆交易。') 
        g=print('賣出',summ,'顆蘋果。')
        h=print('共收',summ*b,'元。')
        營業額統計.append([f,g,h])
    if A==5:
        print('*****************************************************')
        j=print('剩下',a+c-d,'顆蘋果。')
        庫存統計.append(j)
    if A==6:
        print('*****************************************************')
        print('營業結束，明天還會是一個好天!!')
        i=0