商店={'A001':'小熊軟糖 20','A002':'冰棒 25','A004':'王子麵 10','A006':'汽水 30'}
print(商店)
print('以上是現有的商品。')
i=12
while i!=11:
    print('..................................................................')
    h=int(input('1,增加商品.2,購買.3,離開系統'))
    if h==1:
        print('.....................................................................')
        a=str(input('新增商品編號。'))
        b=str(input('新增商品名稱。'))
        c=int(input('新增商品價格。'))
    if h==2:
        d=str(input('商品編號'))
        if d=='A001':
            print('小熊軟糖20元')
        if d=='A002':
            print('冰棒25元')
        if d=='A004':
            print('王子麵10元')
        if d=='A006':
            print('汽水30元')
        if d==a:
            print(b,c,'元')
    if h==3:
        print('營業結束!!')
        i=11